Repository: nakhimchea/travenx_loitafoundation
Catalog: lib/l10n/app_*.arb
Languages: km

# bNavHome
source: Home
km: ទំព័រដើម

# bNavChat
source: Chat
km: សារ

# bNavWallet
source: Wallet
km: កាបូប

# bNavAccount
source: Account
km: គណនី

# rRefreshingText
source: Refreshing
km: កំពុងទាញយកទិន្នន័យ

# rFailedText
source: Failed
km: ទាញយកទិន្នន័យបរាជ័យ

# rCompleteText
source: Completed
km: ទាញយកទិន្នន័យរួចរាល់

# rIdleText
source: Drag down to reload
km: ទាញចុះក្រោមទៀត

# noNetwork
source: Internet is not working. Try again!
km: អ៉ីនធឺណែត៖ មិនដំណើរការ។ សូមព្យាយាមម្តងទៀត!

# searchLabel
source: Search
km: ស្វែងរក

# icAppBar
source: Region preferences
km: តំបន់នីមួយៗ

# icCamping
source: Camping
km: បោះតង់

# icSea
source: Sea
km: សមុទ្រ

# icTemple
source: Temple
km: ប្រាសាទ

# icMountain
source: Mountain
km: ភ្នំ

# icPark
source: Park
km: ឧទ្យាន

# icResort
source: Resort
km: រមណីយដ្ឋាន

# icZoo
source: Zoo
km: សួនសត្វ

# icLocations
source: Other
km: តំបន់ផ្សេងៗ

# icAll
source: All
km: តំបន់ទាំងអស់

# pvLabel
source: In Cambodia
km: ទូទាំងប្រទេស

# pvAppBar
source: All Provinces
km: ខេត្ត/ក្រុងទាំងអស់

# pvTitle
source: All Posts
km: ទីតាំងទាំងអស់

# pvCountPlaces
source: Total Posts:
km: ទីតាំងសរុប៖

# pvPhnomPenh
source: Phnom Penh
km: ភ្នំពេញ

# pvSiemReap
source: Siem Reap
km: សៀមរាប

# pvKampot
source: Kampot
km: កំពត

# pvPreahSihanouk
source: Sihanoukville
km: ព្រះសីហនុ

# pvMondulkiri
source: Mondulkiri
km: មណ្ឌលគិរី

# pvKohKong
source: Koh Kong
km: កោះកុង

# pvRattanakiri
source: Rattanakiri
km: រតនគិរី

# pvKep
source: Kep
km: កែប

# pvPreahVihear
source: Preah Vihear
km: ព្រះវិហារ

# pvKratie
source: Kratie
km: ក្រចេះ

# pvBattambang
source: Battambang
km: បាត់ដំបង

# pvBanteayMeanchey
source: Banteay Meanchey
km: បន្ទាយមានជ័យ

# pvKampongCham
source: Kampong Cham
km: កំពង់ចាម

# pvKandal
source: Kandal
km: កណ្តាល

# pvPursat
source: Pursat
km: ពោធិ៍សាត់

# pvPailin
source: Pailin
km: ប៉ៃលិន

# pvKampongChhnang
source: Kampong Chhnang
km: កំពង់ឆ្នាំង

# pvKampongSpeu
source: Kampong Speu
km: កំពង់ស្ពឺ

# pvKampongThom
source: Kampong Thom
km: កំពង់ធំ

# pvPreyVeng
source: Prey Veng
km: ព្រៃវែង

# pvStungTreng
source: Stung Treng
km: ស្ទឹងត្រែង

# pvSvayRieng
source: Svay Rieng
km: ស្វាយរៀង

# pvTakeo
source: Takeo
km: តាកែវ

# pvOddarMeanchey
source: Oddar Meanchey
km: ឧត្តរមានជ័យ

# pvTbongKhmum
source: Tbong Khmum
km: ត្បូងឃ្មុំ

# pvDefault
source: All Provinces
km: ទាំងអស់

# nbLabel
source: Nearby
km: ទីតាំងក្បែរៗ

# locationClosed
source: Location service is disabled.
km: សេវាប្រាប់ទិសតំបន់ត្រូវបានបិទ។

# locationSet
source: Current location is Phnom Penh.
km: ទីតាំងបានកំណត់នៅភ្នំពេញ។

# locationToOpenWeb
source: Click the above icon to enable!
km: ចុចលើនិមិត្តសញ្ញាទីតាំងខាងលើ ដើម្បីបើកឡើងវិញ!

# locationToOpenMobile
source: Click here to enable!
km: ចុចទីនេះដើម្បីបើកឡើងវិញ!

# nbNoData
source: No nearby posts.
km: មិនមានទិន្នន័យអំពីទីតាំងក្បែរៗ។

# tbNewPlacesLabel
source: New Places
km: កន្លែងថ្មី

# tbNewEventsLabel
source: New Events
km: ព្រឹត្តិការណ៍ថ្មី

# tbMostVisitsLabel
source: Top Views
km: ច្រើនទស្សនា

# tbMostFamousLabel
source: Popular Places
km: ល្បីប្រចាំខែ

# tbAllPlacesLabel
source: All Places
km: ទាំងអស់

# chatLabel
source: Chat
km: សារ

# chatNoData
source: No chat messages.
km: មិនមានទិន្នន័យសារ។

# chatPopMarkAsRead
source: Mark all as read
km: សន្មត់ថាបានអានទាំងអស់

# chatPopArchive
source: Archives
km: សារដែលបានខ្ចប់

# chatPopReport
source: Report
km: រាយការណ៍បញ្ហា

# lgConnectPhone
source: Connect with Phone Number
km: ភ្ជាប់តាមគណនី លេខទូរសព្ទ

# lgConnectFacebook
source: Connect with Facebook
km: ភ្ជាប់តាមគណនី ហ្វេសប៊ុក

# lgConnect
source: Connect with
km: ភ្ជាប់តាមគណនី

# lgEnterCode
source: 6-digit code
km: បញ្ចូលលេខកូដ

# lgSendCode
source: Send Code
km: ផ្ញើលេខកូដ

# lgSecond
source: second
km: វិនាទី

# lgOr
source: or
km: ឬ

# skipLabel
source: Skip
km: រំលង

# lgLogIn
source: Log in
km: ចូល

# lgAccept
source: Using this application you agree to accept
km: តាមរយ:ការប្រើកម្មវិធីនេះ អ្នកយល់ព្រមទទួលយក

# lgTermsPolicies
source: Terms and Policies
km: លក្ខខណ្ឌ និងគោលនយោបាយឯកជនភាព

# pfAddPost
source: Publish a business
km: បង្ហោះទីតាំង ឬអាជីវកម្ម

# pfApFromTime
source: From
km: ចាប់ពីម៉ោង

# pfApToTime
source: Until
km: ដល់ម៉ោង

# pfApLocation
source: Location
km: ទីតាំង

# pfApBasic
source: Basic
km: ចាំបាច់

# pfApAdditional
source: Additional
km: បន្ថែម

# pfApPreview
source: Preview
km: ពិនិត្យ

# pfApSoLabel
source: Business Location Service
km: សេវាប្រាប់ទិសតំបន់ទីតាំង ឬអាជីវកម្ម

# pfApSoDescription
source: You need to be at your business location to proceed. By clicking on the checkbox, you acknowledge to give access to location services in order to generate information, weather and other forecasts. You must enable location services to continue.
km: លោកអ្នកត្រូវតែនៅទីតាំង ឬអាជីវកម្ម ដើម្បីបង្ហោះផ្សាយពាណិជ្ជកម្មនេះបាន។ លោកអ្នកត្រូវទទួលស្គាល់ថាពួកយើងចាប់យកទីតាំងដែលលោកអ្នកកំពុងស្ថិតនៅ ដើម្បីចាប់យក ព័ត៌មាន អាកាសធាតុ ព្យាករណ៍ និងពេលវេលាថ្ងៃរះ និងលិចនៅទីតាំងរបស់លោកអ្នក។ ដាច់ខាតលោកអ្នកត្រូវតែបើកសេវាប្រាប់ទិសតំបន់ដើម្បីបន្ត។

# pfApSoCheckbox
source: I am at my business location and agree to allow accesses to Location Services.
km: យល់ព្រមបើកសេវាប្រាប់ទិសតំបន់ និង ទទួលស្គាល់ថាលោកអ្នកបាននៅទីតាំង ឬអាជីវកម្មផ្ទាល់។

# pfApStLabel
source: Basic Info
km: ព័ត៌មានចាំបាច់

# pfApStTitleLabel
source: Title
km: ចំណងជើង

# pfApStTitleHint
source: Coffee &Cake
km: ហាងកាហ្វេ និងនំខេក

# pfApStPriceLabel
source: Price ($)
km: តម្លៃ ($)

# pfApStPriceHint
source: $0.00 (Free Entry)
km: $0.00 (Free ឬចូលដោយសេរី)

# pfApStBusinessType
source: Business types (one or more)
km: ប្រភេទតំបន់ទីតាំង ឬអាជីវកម្ម (ជ្រើសរើសបានលើសពី១)

# pfApStImagePickerLabel
source: Highlight photos (first photo will be most displayed)
km: រូបភាពទាក់ទាញ (រូបដំបូងនឹងត្រូវបានដាក់បង្ហាញជាងគេទៅអតិថិជន)

# pfApSthAdditionalLabel
source: Additional Info
km: ព័ត៌មានបន្ថែម

# pfApSthAdditionalAtLabel
source: at
km: ម៉ោង

# pfApSthAdditionalOpenLabel
source: Open
km: បើកដំណើរការ

# pfApSthAdditionalCloseLabel
source: Close
km: ផ្អាកដំណើរការ

# pfApSthActivityLabel
source: Activities (one or more)
km: សកម្មភាព (ជ្រើសរើសបានលើសពី១)

# pfApSthDetailsLabel
source: Details
km: ព័ត៌មានលម្អិត

# pfApSthDetailsHint
source: Example: Angkor wat is a buddhism temple located in northwest of Cambodia. It is one of the world heritages by UNESCO, a special tourism destination, and especially a symbol of Cambodia.
km: ឧទាហរណ៍៖ ប្រាសាទអង្គរវត្ត ជាប្រាសាទពុទ្ធសាសនា នៅភាគពាយ័ព្យនៃប្រទេសកម្ពុជា។ ប្រាសាទនេះគឺជាសម្បត្តិបេតិកភណ្ឌពិភពលោករបស់អង្គការយូណេស្កូ និងជាគោលដៅទេសចរណ៍ដ៏សំខាន់មួយដែលជានិមិត្តសញ្ញាជាតិ និងជាទីសក្ការៈនៃព្រះពុទ្ធសាសនាខ្មែរ។

# pfApSthPoliciesLabel
source: Policies
km: គោលការណ៍ ឬសេចក្តីណែនាំ

# pfApSthPoliciesHint
source: Allow at maximum of 2 people in a room.
km: អនុញ្ញាតិអោយមានភ្ញៀវអតិបរមា២នាក់ក្នុងមួយបន្ទប់។

# pfApSthAnnouncementLabel
source: Announcement
km: សេចក្តីប្រកាស (ឧទាហរណ៍៖ អំពីCoViD-19)

# pfApSthAnnouncementHint1
source: Example: Please appoint clinic or hospital doctors if you have any health issues or contact:
km: ឧទាហរណ៍៖ ប្រសិនបើលោកអ្នកមានបញ្ហាសុខភាព ឬមានជម្ងឺ ឬសង្ស័យថាមានការឆ្លងជម្ងឺ សូមប្រញាប់ទៅស្វែងរកការពិនិត្យពិគ្រោះនៅមន្ទីរពេទ្យរដ្ឋ ឬទំនាក់ទំនងតាមលេខទូរស័ព្ទ៖

# pfApSthAnnouncementHint2
source: 012 825 424 or 012 488 981 or 012 836 868
km: ០១២ ៨២៥ ៤២៤ ឬ ០១២ ៤៨៨ ៩៨១ ឬ ០១២ ៨៣៦ ៨៦៨

# backLabel
source: Previous
km: ថយក្រោយ

# nextLabel
source: Next
km: បន្ទាប់

# pfAddedPost
source: Posted places or businesses
km: ទីតាំង ឬអាជីវកម្មបានបង្ហោះ

# pfAddedPostNoData
source: No Data
km: មិនមានទិន្នន័យអំពីទីតាំង ឬអាជិវកម្មរបស់អ្នក។

# pfProfile
source: Profile information
km: ប្រវត្តិរូប

# pfSaved
source: Saved places
km: បានរក្សាទុក

# pfReviewed
source: Reviewed places
km: បានវាយតម្លៃ

# pfLanguages
source: Language
km: ភាសា

# pfAboutUs
source: About us
km: អំពីយើង

# pfTermsAndPolicies
source: Terms &Policies
km: លក្ខខណ្ឌ និងគោលការណ៍ផ្សេងៗ

# pfFAQ
source: Frequently asked questions
km: សំនួរ/ចម្លើយ

# pfRateUs
source: Rate us
km: វាយតម្លៃកម្មវិធី

# pfShare
source: Share
km: ចែករំលែកកម្មវិធី

# pfLogOut
source: Log out
km: ចាកចេញ

# pfVersion
source: Version 1.0.0
km: កម្មវិធីជំនាន់ទី ១.០.០

# pdThisPlaceIsYours
source: This place is yours!
km: កន្លែងនេះជារបស់អ្នក!

# pdProductAndServices
source: Products &Services
km: ផលិតផល និងសេវាកម្ម

# pdAnnouncementLabel
source: Announcement
km: សេចក្ដីជូនដំណឹង

# pdReadmore
source: read more
km: អានបន្ថែម

# resetLabel
source: Reset
km: កំណត់ឡើងវិញ

# doneLabel
source: Done
km: រួចរាល់

# pdBusinessHourLabel
source: Business hours:
km: បើកដំណើរការ

# pdBdReviewLabel
source: ratings
km: វាយតម្លៃ

# pdBdDistanceLabel
source: distance
km: ចម្ងាយ

# pdBdForecastLabel
source: forecast
km: ព្យាករណ៍

# pdBdViewLabel
source: views
km: អ្នកចូលមើល

# pdActivityLabel
source: Activities
km: សកម្មភាព

# pdActivityBoating
source: Boating
km: ជិះទូក

# pdActivityDiving
source: Diving
km: មើលផ្កាថ្ម

# pdActivityFishing
source: Fishing
km: ស្ទូចត្រី

# pdActivityRelaxing
source: Relaxing
km: លំហែកាយ

# pdActivitySwimming
source: Swimming
km: ហែលទឹក

# pdDetailsLabel
source: Details
km: លំអិត

# pdDetailsGetDirection
source: Get direction on
km: ចូលទៅកាន់

# pdPoliciesLabel
source: Policies
km: គោលការណ៍

# pdGalleryLabel
source: Gallery
km: កម្រងរូបភាព

# pdGalleryUploadLabel
source: Upload Photos
km: ចែករំលែករូបភាព

# pdShowAllLabel
source: Show all
km: បង្ហាញទាំងអស់

# pdGallerySharePublic
source: Your photos will be shared in public.
km: ការចែករំលែករូបភាពនឹងត្រូវបង្ហោះជាសាធារណៈ។

# pdCancelLabel
source: Cancel
km: បោះបង់

# pdUploadLabel
source: Upload
km: ចែករំលែក

# pdReviewLabel
source: Review
km: វាយតម្លៃ

# pdReviewAddLabel
source: Create a review
km: ដាក់វាយតម្លៃ

# pdReviewInstruction
source: Click on this stars to rate.
km: ចុចលើរូបផ្កាយដើម្បីវាយតម្លៃ

# pdReviewCommentHint
source: Comment here...
km: ចុចបញ្ចេញមតិទីនេះ

# pdReviewSharePublic
source: Your review will be shared in public.
km: ការបញ្ចេញមតិនឹងត្រូវបង្ហោះជាសាធារណៈ។

# postLabel
source: Post
km: បង្ហោះ
